In [4]:
import pandas as pd
import matplotlib.pyplot as plt

Read the data into a dataframe:

In [5]:
titanic_dataset = pd.read_csv('./titanic.csv')
titanic_dataset

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

Summary of the dataframe:

In [6]:
titanic_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

Check for unique values in each column:

In [28]:
print("--- No. of Unique Column Values ---")

titanic_dataset.nunique(dropna=True)

--- No. of Unique Column Values ---

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             89
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [8]:
titanic_dataset['Survived'].value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

In [9]:
titanic_dataset['Survived'] = titanic_dataset['Survived'].replace({
	0: 'No',
	1: 'Yes'
})
titanic_dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,No,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,Yes,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,Yes,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,Yes,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,No,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
titanic_dataset['Pclass'].value_counts()

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [11]:
titanic_dataset['Pclass'] = titanic_dataset['Pclass'].replace({
	3: 'Third',
	1: 'First',
	2: 'Second'
})
titanic_dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,No,Third,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,Yes,First,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,Yes,Third,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,Yes,First,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,No,Third,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [12]:
titanic_dataset['Pclass'].value_counts()

Pclass
Third     491
First     216
Second    184
Name: count, dtype: int64

In [13]:
titanic_dataset['Sex'].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [14]:
titanic_dataset['Sex'] = titanic_dataset['Sex'].replace({
	'male': 'Male',
	'female': 'Female'
})
titanic_dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,No,Third,"Braund, Mr. Owen Harris",Male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,Yes,First,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,Yes,Third,"Heikkinen, Miss Laina",Female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,Yes,First,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",Female,35.0,1,0,113803,53.1000,C123,S
4,5,No,Third,"Allen, Mr. William Henry",Male,35.0,0,0,373450,8.0500,NaN,S

In [15]:
titanic_dataset['Sex'].value_counts()

Sex
Male      577
Female    314
Name: count, dtype: int64

Convert data types:

In [21]:
data_types = {
	'Survived': 'category',
	'Pclass': 'category',
	'Sex': 'category',
	'Embarked': 'category',
}
titanic_dataset = titanic_dataset.astype(data_types)
titanic_dataset.dtypes

PassengerId       int64
Survived       category
Pclass         category
Name             object
Sex            category
Age             float64
SibSp             int64
Parch             int64
Ticket           object
Fare            float64
Cabin            object
Embarked       category
dtype: object

Examine the nature of age in the dataset:

In [16]:
titanic_dataset['Age'].value_counts()

Age
24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: count, Length: 88, dtype: int64

In [17]:
titanic_dataset['Age'].agg(['min', 'max', 'mean']).T

min      0.420000
max     80.000000
mean    29.699118
Name: Age, dtype: float64

Fill the missing values in the `titanic_dataset['Age']` column before conversion with the mean value of the column.

In [29]:
titanic_dataset['Age'].fillna(
    titanic_dataset['Age'].mean(),
    inplace=True
)
titanic_dataset['Age'].info()

print("--- Filled missing values in the 'Age' column. ---")

<class 'pandas.core.series.Series'>
RangeIndex: 891 entries, 0 to 890
Series name: Age
Non-Null Count  Dtype
--------------  -----
891 non-null    float64
dtypes: float64(1)
memory usage: 7.1 KB
--- Filled missing values in the 'Age' column. ---

Check for duplicates in each column:

In [ ]:
titanic_dataset.duplicated().value_counts()

Check for missing values:

In [ ]:
titanic_dataset.isna().sum()

View the missing values in the `titanic_dataset['Embarked']` column:

In [ ]:
titanic_dataset.loc[titanic_dataset['Embarked'].isna() == True]

It appears the passengers never embarked on the ship, therefore we drop their respective entries as they won't be relevant to the main target variable i.e. Survival.

In [ ]:
titanic_dataset.dropna(subset=['Embarked'], inplace=True)
titanic_dataset.info()

View the missing values in the `titanic_dataset['Age']` column:

In [ ]:
titanic_dataset.loc[titanic_dataset['Age'].isna() == True]

In [ ]:
titanic_dataset['Age'].value_counts()